DeviceNetworkEvents
| where ActionType == "InboundInternetScanInspected"
| where Timestamp > ago(7d)
| project Timestamp, DeviceName, LocalIP, LocalPort, RemoteIP, RemotePort
// | summarize ScanCount = count() by RemoteIP
// | sort by ScanCount desc
